NextFOAM-2501/tutorials/multiphase/multiphaseEulerFoam/mixerVessel2D/constant/interfacialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      interfacialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dragModel1          SchillerNaumann;
dragModel2          SchillerNaumann;

heatTransferModel1  RanzMarshall;
heatTransferModel2  RanzMarshall;

dispersedPhase      both;
dragPhase           blended;

residualSlip        1e-2;
minInterfaceAlpha   1e-3;


// ************************************************************************* //
